#27. Определить количество цифр в числе

a = input('Введите число: ')


def Quantity (a):
    b = len(a)
    return b

print(f'В {a} {Quantity(a)} цифр')